grouper-ws/grouper-ws/doc/xmlExamples/stemSaveSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:stemSave xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:wsStemsToSave>
        <ns1:createStemsIfNotExist></ns1:createStemsIfNotExist>
        <ns1:description>the test stem</ns1:description>
        <ns1:displayExtension>test stem</ns1:displayExtension>
        <ns1:saveMode></ns1:saveMode>
        <ns1:stemName>aStem:testStem</ns1:stemName>
        <ns1:stemUuid></ns1:stemUuid>
      </ns1:wsStemsToSave>
      <ns1:actAsSubjectLookup>
        <ns1:subjectId>GrouperSystem</ns1:subjectId>
      </ns1:actAsSubjectLookup>
    </ns1:stemSave>
  </soapenv:Body>
</soapenv:Envelope>